uhnp/src/Reports/ПлатежныйКалендарьУХ/ПлатежныйКалендарьУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПлатежныйКалендарьУХ</name>
  <comment>(-УХ)</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтбора</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяВерсияПлатежногоКалендаря</name>
    <type>
      <types>CatalogRef.СохраненныеВерсииПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОстаткиСУчетомОвердрафтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПоступленияПередСписаниями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СворачиватьНеуправляемыеСписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритетуПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСумме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСуммеПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоДнейОперативногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаОтображенияПросроченныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СценарийСтрессТестированияЛиквидности</name>
    <type>
      <types>CatalogRef.СценарииСтрессТестированияЛиквидности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДиаграмму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОбороты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтОперативногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаТаблицыОстатковИОборотов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМакетаОформления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОтбораПросроченныхЗаявок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПереводаМеждуСчетами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссииПриКонвертацииВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СущественнаяРазницаСтоимостиКредитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДанныеВВалютеОтображения</name>
    <comment>Выводить данные календаря в валюте отображения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкиОтчета</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтТактическогоПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОперативногоПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьТолькоКассовыеРазрывы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПлатежногоКалендаря</name>
    <type>
      <types>EnumRef.ВариантыПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВходящихОстатков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСобытияФормированияОтчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыводаОборотов</name>
    <type>
      <types>EnumRef.РежимыВыводаОборотовПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализаЭкстраполяцииДенежныхПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДолгосрочногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтДолгосрочногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаДанныхДоговоров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДоверительныеКоэффициентыПриПланированииПоступлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБазоваяФункциональность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлановыеКурсы</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаВесовЛиквидности</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>EnumRef.ИсточникиДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоризонтПланированияЛиквидности</name>
      <type>
        <types>EnumRef.ГоризонтыПланированияЛиквидности</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>DefinedType.ВесИсточникаДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаВариантовОптимизации</name>
    <attributes>
      <name>ВариантОптимизации</name>
      <type>
        <types>EnumRef.ВариантыОптимизацииПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

uhnp/src/Documents/РеестрПлатежей/РеестрПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрПлатежей</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеМаршрута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаявкиНаОплату</name>
    <attributes>
      <name>Исключена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаОплату</name>
      <type>
        <types>DefinedType.ДокументыРеестраПлатежей</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПлатежа</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>DefinedType.Договор</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>210</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КтоИсключил</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИсключения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчетКасса</name>
      <type>
        <types>DefinedType.БанковскийСчетКасса</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНарушения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>CatalogRef.ПриоритетыПлатежей</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Reports/ПлатежныйКалендарьУХ/Forms/ФормаСозданияРеестровПлатежей/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаРеестра = ТекущаяДатаСеанса();
	
	УстановитьУсловноеОформление();
	
	ЗаполнитьТаблицуОрганизаций();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОрганизацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаРеестраПриИзменении(Элемент)
	
	ЗаполнитьТаблицуОрганизаций();

КонецПроцедуры 

&НаКлиенте
Процедура ДекорацияДоступныеДатыНажатие(Элемент)
	
	СписокДат = СписокДатНеобработанныхПлатежей();  
	
	Если Не СписокДат.Количество() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необработанные заявки не найдены'"));
		Возврат;	
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораДатыПлатежаВСписке", ЭтотОбъект);
	СписокДат.ПоказатьВыборЭлемента(Оповещение,НСтр("ru = 'Выберите дату реестра'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОрганизаций

&НаКлиенте
Процедура ОткрытьРеестрПлатежей(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаОрганизаций.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.РеестрПлатежей) Тогда
		ПоказатьЗначение(,ТекущиеДанные.РеестрПлатежей);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРеестрПлатежей(Команда)
	
	Если Не ЗначениеЗаполнено(ДатаРеестра) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо указать дату реестра платежей'"));
		Возврат;
	КонецЕсли; 
	
	Если ДатаРеестра < НачалоДня(ТекущаяДатаСервера()) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Создание реестра платежей за предыдущий период недоступно'"));
		Возврат;
	КонецЕсли; 
	
	СоздатьРеестрПлатежейНаСервере();
	
КонецПроцедуры

&НаКлиенте    
Процедура УстановитьФлажки(Команда)
	УстановитьЗначенияФлажков(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьЗначенияФлажков(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

 Элемент = УсловноеОформление.Элементы.Добавить();

 ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
 ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОрганизаций");

 ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
 ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОрганизаций.РеестрСоздан");
 ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
 ОтборЭлемента.ПравоеЗначение = Истина;

 Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НейтральноЗеленый);
КонецПроцедуры

//Блинова М.А. 13.05.2026 Выполнение задач №000057501
//&НаСервереБезКонтекста
//Функция ТекущаяДатаСервера()
//	
//	Возврат ТекущаяДатаСеанса();
//	
//КонецФункции 
 
&НаСервереБезКонтекста
Функция СписокДатНеобработанныхПлатежей()
	
	ДатыНеобработанныхПлатежей = Документы.РеестрПлатежей.ДатыНеобработанныхПлатежей(НачалоДня(ТекущаяДатаСеанса()));
	
	СписокДат =  Новый СписокЗначений; 
	
	Для Каждого ДатаПлатежа Из ДатыНеобработанныхПлатежей Цикл
		
		ДатаПлатежаСтрокой = Формат(ДатаПлатежа,"ДЛФ=D"); 
		
		Если ДатаПлатежа < ТекущаяДатаСеанса() Тогда
			ПредставлениеДатыПлатежа = ДатаПлатежаСтрокой + " " + НСтр("ru = '(создание реестра недоступно)'");
		Иначе 
			ПредставлениеДатыПлатежа = ДатаПлатежаСтрокой;
		КонецЕсли;
		
		СписокДат.Добавить(ДатаПлатежа, ПредставлениеДатыПлатежа);	
		
	КонецЦикла;
	
	Возврат СписокДат; 

КонецФункции 

&НаКлиенте
Процедура ПослеВыбораДатыПлатежаВСписке(Результат,Параметры) Экспорт

	Если Результат <> Неопределено Тогда 
		
		ВыбраннаяДата = Результат.Значение;
		
		ДатаРеестра = ВыбраннаяДата;
		ЗаполнитьТаблицуОрганизаций();

	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОрганизаций()
	
	ТаблицаОрганизаций.Очистить();
	
	ОрганизацииПлатежей = Документы.РеестрПлатежей.ОрганизацииПлатежей(ДатаРеестра);
	
	Если ОрганизацииПлатежей.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не обработанные заявки на дату %1 не найдены'"),Формат(ДатаРеестра,"ДЛФ=D")));
		Возврат;	
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ОрганизацииПлатежей Цикл 
		
		НовСтр = ТаблицаОрганизаций.Добавить();
		НовСтр.Организация = СтрокаТаблицы.Организация;
		НовСтр.КоличествоЗаявок = СтрокаТаблицы.КоличествоЗаявок;
		НовСтр.СоздаватьРеестрПлатежей = Истина; 
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияФлажков(ЗначениеФлажка)
	
	Для Каждого СтрокаТаблицы Из ТаблицаОрганизаций Цикл   
		СтрокаТаблицы.СоздаватьРеестрПлатежей = ЗначениеФлажка;	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СоздатьРеестрПлатежейНаСервере() 
	
	ВыбранныеОрганизации = ТаблицаОрганизаций.НайтиСтроки(Новый Структура("СоздаватьРеестрПлатежей",Истина));
	
	Если ВыбранныеОрганизации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ВыбранныеОрганизации Цикл
	
		СогласованныеПлатежи = Документы.РеестрПлатежей.СписокСогласованныхПлатежей(СтрокаТаблицы.Организация, ДатаРеестра);
		
		Если СогласованныеПлатежи.Количество() Тогда
			
			Заявки = Новый Массив;
			
			ДокументОбъект = Документы.РеестрПлатежей.СоздатьДокумент();
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("ДатаОплаты",ДатаРеестра);
			ДанныеЗаполнения.Вставить("Организация",СтрокаТаблицы.Организация);
			
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			
			Если ДокументОбъект.ЗаявкиНаОплату.Количество() Тогда 
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				СтрокаТаблицы.РеестрСоздан = Истина;
				СтрокаТаблицы.РеестрПлатежей = ДокументОбъект.Ссылка;
					
			КонецЕсли;
		Иначе
			
			ОбщегоНазначения.СообщитьПользователю(
										СтрШаблон(НСтр("ru = 'Не обработанные заявки на дату %1 по организации %2 не найдены'"),Формат(ДатаРеестра,"ДЛФ=D"),СтрокаТаблицы.Организация));
			
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти
